In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie"],
    "age": [30, 25, 35],
    "score": [85.5, 90.0, 78.0]
})
df

      name  age  score
0    Alice   30   85.5
1      Bob   25   90.0
2  Charlie   35   78.0

In [3]:
df

      name  age  score
0    Alice   30   85.5
1      Bob   25   90.0
2  Charlie   35   78.0

In [4]:
df.describe()

        age      score
count   3.0   3.000000
mean   30.0  84.500000
std     5.0   6.082763
min    25.0  78.000000
25%    27.5  81.750000
50%    30.0  85.500000
75%    32.5  87.750000
max    35.0  90.000000